{
  "to": "affiliates@flatexdegiro.com",
  "subject": "Affiliate partnership — Social Trading Vlog (66K YouTube subs, multi-language European content)",
  "body": "Hi,\n\nI'm Tom from Social Trading Vlog — a YouTube channel and website focused on social trading and online investing, with a strong European audience.\n\nI'm expanding my content to cover a wider range of investment platforms, and DEGIRO is a natural fit given my audience demographics.\n\nHere's what I bring to the table:\n\n- YouTube: 66,400+ subscribers, 4.5 million total views, 335 videos\n- Top video: 826,000+ views on retail trading content\n- Website: socialtradingvlog.com — SEO-optimised with interactive comparison tools and educational content\n- Multi-language content: site translated into Spanish, German, French, Portuguese, and Arabic — directly targeting the European markets where DEGIRO operates\n- Audience: retail investors comparing platforms, many in DEGIRO's core markets (Netherlands, Germany, France, Spain, and more)\n- Based in Malta (EU), creating content since 2016 — nearly 10 years of documented investing experience\n\nDEGIRO is already featured on my interactive platform comparison tool at socialtradingvlog.com/calculators/compare-platforms/, where visitors can compare features, fees, and regulation across major platforms.\n\nI'm also producing comparison articles targeting keywords like 'eToro vs DEGIRO' and 'best investment platform Europe' — content that reaches people at the exact moment they're deciding which platform to use.\n\nThe fact that my site is available in 5 European languages means I can drive qualified traffic from multiple DEGIRO markets simultaneously. This is rare for a single content creator.\n\nI'd love to discuss partnership terms, particularly:\n- Enhanced CPA or CPL rates reflecting the quality of my multi-language European traffic\n- Whether you offer performance tiers for higher-volume affiliates\n- Any content or promotional support\n\nHappy to provide detailed analytics or discuss over a call.\n\nBest regards,\nTom West\nSocial Trading Vlog\nhttps://socialtradingvlog.com\nhttps://www.youtube.com/socialtrading"
}
