{
  "to": "affiliates@500affiliates.com",
  "subject": "Affiliate partnership enquiry — Social Trading Vlog (66K YouTube subscribers)",
  "body": "Hi there,\n\nI'm Tom from Social Trading Vlog — a YouTube channel and website focused on social trading and online investing.\n\nI'm reaching out because I'm expanding my content to cover more trading platforms beyond eToro, and I'd like to discuss a partnership with Plus500 through your affiliate programme.\n\nHere's a quick overview of my platform:\n\n- YouTube: 66,400+ subscribers, 4.5 million total views, 335 videos\n- Top video: 826,000+ views on a single video about retail trading\n- Website: socialtradingvlog.com — SEO-optimised with interactive tools and comparison content\n- International reach: site content available in 6 languages (English, Spanish, German, French, Portuguese, Arabic)\n- Audience: retail investors actively comparing trading platforms and considering new accounts\n- Nearly 10 years of documented, real-money trading experience since 2016\n\nI've already built an interactive platform comparison tool (socialtradingvlog.com/calculators/compare-platforms/) where Plus500 is featured alongside other major platforms. I'm also producing detailed comparison articles targeting high-intent keywords like 'eToro vs Plus500'.\n\nThis content is specifically designed to help people decide which platform to use — exactly the moment they're ready to sign up.\n\nGiven the size of my audience and the commercial intent of my content, I'd like to discuss premium affiliate terms rather than the standard entry rates. Specifically:\n\n- Enhanced CPA rates reflecting the quality and intent of my traffic\n- Potential revenue share arrangement for long-term partnership\n- Any creator-specific programmes or premium tiers you offer\n\nI'm happy to share detailed analytics or get on a call to discuss this further.\n\nBest regards,\nTom West\nSocial Trading Vlog\nhttps://socialtradingvlog.com\nhttps://www.youtube.com/socialtrading"
}
