{
  "to": "partnerships@trading212.com",
  "subject": "Partnership enquiry — Social Trading Vlog (66K subs, 4.5M views, comparison content)",
  "body": "Hi,\n\nI'm Tom from Social Trading Vlog — a YouTube channel and website dedicated to social trading and online investing.\n\nI'm expanding my content beyond eToro to cover the wider trading platform landscape, and I believe there's a strong fit for a partnership with Trading 212.\n\nMy platform at a glance:\n\n- YouTube: 66,400+ subscribers, 4.5 million total views across 335 videos\n- Top video: 826,000+ views (retail trading and broker content)\n- Website: socialtradingvlog.com — fully SEO-optimised with interactive comparison tools\n- International audience: content in 6 languages reaching UK, European, and Middle Eastern markets\n- Demographic: retail investors actively researching and comparing trading platforms\n- Track record: nearly 10 years of consistent, real-money content creation (since 2016)\n\nTrading 212 is already featured on my interactive platform comparison tool at socialtradingvlog.com/calculators/compare-platforms/, and I'm currently producing detailed comparison articles (including 'eToro vs Trading 212') that target high-intent search keywords.\n\nMy content focuses on honest, experience-based comparisons — which tends to convert well because viewers trust the recommendation. I never promote platforms I wouldn't use myself.\n\nGiven the scale and intent of my audience, I'd like to discuss your premium partnership tiers. I understand you work with select content creators on enhanced terms, and I believe my channel's size, niche focus, and content quality would qualify.\n\nI'm particularly interested in:\n- Your CPA rates for the Grow Big or Go Expert tiers\n- Whether you offer hybrid CPA + revenue share arrangements\n- Any content support or co-promotion opportunities\n\nHappy to share analytics or jump on a call at your convenience.\n\nBest regards,\nTom West\nSocial Trading Vlog\nhttps://socialtradingvlog.com\nhttps://www.youtube.com/@SocialTradingVlog"
}
