{
  "to": "partnership.me@xtb.com",
  "subject": "Influencer partnership enquiry — Social Trading Vlog (66K YouTube subscribers)",
  "body": "Hi,\n\nI'm Tom from Social Trading Vlog — a YouTube channel and website covering social trading, copy trading, and online investing.\n\nI'm reaching out because I'm expanding my content to cover more trading platforms, and I'd like to explore a partnership with XTB.\n\nA quick overview of my platform:\n\n- YouTube: 66,400+ subscribers, 4.5 million total views, 335 published videos\n- Top video: 826,000+ views on a single video about retail trading\n- Website: socialtradingvlog.com — SEO-optimised with interactive tools, comparison content, and educational guides\n- International reach: full site content in 6 languages (English, Spanish, German, French, Portuguese, Arabic)\n- Audience: retail traders and investors actively comparing platforms and looking to open accounts\n- Experience: nearly 10 years of documented, real-money trading since 2016\n\nXTB is already featured on my interactive platform comparison tool at socialtradingvlog.com/calculators/compare-platforms/, and I'm producing detailed comparison articles that target high-intent keywords. My content focuses on honest, experience-based reviews — which I find converts far better than generic promotional content.\n\nI see that XTB works directly with influencers and offers customised CPA models. Given the size and commercial intent of my audience, I'd like to discuss premium partnership terms:\n\n- Enhanced CPA rates (I understand you offer up to $600 for Forex/Commodities in Group 1 markets)\n- Whether a SpreadShare revenue model might complement CPA for long-term partnership value\n- Content collaboration opportunities — I'd be happy to create dedicated XTB content\n- A dedicated affiliate manager to help optimise the partnership\n\nI'm based in Malta and happy to schedule a call or provide detailed analytics.\n\nBest regards,\nTom West\nSocial Trading Vlog\nhttps://socialtradingvlog.com\nhttps://www.youtube.com/socialtrading"
}
