{
  "to": "jcantor@interactivebrokers.com",
  "subject": "RE: Interactive Brokers - Social Media Influencer Opportunity - Social Trading Vlog",
  "body": "Hi Josh,\n\nI hope you're well. I realise I'm long overdue in getting back to you — you've reached out a few times now and I apologise for the slow response.\n\nI'd love to pick up the conversation about working together. A lot has changed since your first email in 2022, and I think the timing is right.\n\nHere's where things stand with Social Trading Vlog:\n\n- 66,400+ YouTube subscribers (up significantly since we last spoke)\n- 4.5 million total video views across 335 videos\n- Top video: 826,000+ views (\"Why Do 76% Lose Money?\")\n- My website socialtradingvlog.com now features interactive tools including a platform comparison tool where Interactive Brokers is already featured: socialtradingvlog.com/calculators/compare-platforms/\n- The site has 180+ pages translated into 5 languages (Spanish, German, French, Portuguese, Arabic) — reaching European and Middle Eastern audiences\n- Dedicated SEO-optimised content targeting long-tail trading keywords\n- Nearly 10 years of documented, real-money trading experience\n\nMy audience is exactly who you'd want to reach: retail investors interested in trading platforms, many of whom are comparing options and deciding where to open accounts.\n\nI already feature IBKR on my platform comparison tool and I'm about to publish detailed 'eToro vs Interactive Brokers' comparison content. Given that I'm expanding beyond eToro-only content, I'd like to explore your Influencer Programme properly.\n\nSpecifically, I'd be interested in discussing:\n- Your CPC influencer programme rates — I understand top creators can earn significant monthly income\n- Whether a hybrid model (CPC + account signups) might work better for my audience\n- What support you provide for content creation and promotion\n\nI'm available for a 30-minute introductory call at your convenience. I'm based in Malta (CET timezone) and generally flexible on timing.\n\nLooking forward to finally connecting.\n\nBest regards,\nTom West\nSocial Trading Vlog\nhttps://socialtradingvlog.com\nhttps://www.youtube.com/socialtrading"
}
